:PROPERTIES:
:ID:       a8dbbd4f-b7fe-4347-8cb9-ef0aa7a5d54e
:END:
#+TITLE: Org Babel: Fast Yasnippet Template Vars
#+CATEGORY: slips
#+TAGS:  

* Notes

I need to do this constantly.

#+begin_example org
# ** Some headline

:PROPERTIES:
:header-args+: :var chkout=(expand-file-name "omarchy" (or (bound-and-true-p ob@arch_omarchy_bin_scripts) (setq ob@arch_omarchy_bin_scripts (make-temp-file "roam-" t))))
:header-args+: :dir (identity ob@arch_omarchy_bin_scripts)
:END:

Basically, which content do you choose to import?

#+name: omarchyCheckout
#+begin_src emacs-lisp
chkout
#+end_src

#+begin_src shell
echo $chkout
echo $(pwd)
#+end_src

#+RESULTS:
| /tmp/tmp.rgcmqtkWEC/omarchy |
| /tmp/tmp.rgcmqtkWEC         |
#+end_example

So i came up with some snippets, which are further below. Still needs some work
though.

Expanding the snippet ends up running =(dc/org-roam-get-slug)= which is basically
just wrapping =(org-roam-node-slug)= for the current =org-mode= buffer.

+ yasnippet maintains the =(current-buffer)= as the execution context for its
  expanded =emacs-lisp= values, so that function returns the correct value
+ since the snippets all turn to text, we can guarantee their evaluation is
  complete.

I've tried this previously, but it's hard to predict the scoping for the
=org-babel= blocks if the retrieval of values happens too close to runtime.

+ each babel block usually has its own scope (closure)
+ s to names specified by =:var= need =(identity emacs-lisp-var)= and
  can otherwise only include =#+name: valueByName=
+ the results of each function is the interface through which results are
  normally passed
+ results can be cached and evaluation can be suppressed/silenced.
+ if you import functions from other org files via Library of Babel, then these
  usually execute in another context

I kept experimenting with different ways of handling this, so I didn't want to
streamline it and preclude the ability to quickly =grep= or =regexp-replace= it in
the future.

The =ob@= prefix for global variable names is rarely used.

